print('Отслеживание заказа')

order = input('Введите статус вашего заказа: ')

match order:
    case 'pending':
        status = 'В ожидании 🕒'
        describe = 'Ваш заказ принят системой.'
        time = '1-2 часа'
        recommendation = 'Подождите. если указанное время истекло, обратитесь в поддержку.'
    case 'processing':
        status = 'В обработке ⚙️'
        describe = 'Ваш заказ оформлен и находится на сборке.'
        time = '1-2 дня'
        recommendation = 'Следите за уведомлением об отправке.'
    case 'shipped':
        status = 'Отправлено ✈️'
        describe = 'Ваш заказ в пути.'
        time = '2-5 дней'
        recommendation = 'Следите за уведомлением о доставке.'
    case 'delivered':
        status = 'Доставлено 📦'
        describe = 'Ваш заказ прибыл в точку назначения.'
        time = 'Хранится на складе 14 дней.'
        recommendation = 'Заберите заказ до окончания срока.'
    case 'cancelled':
        status = 'Отменен ✖️'
        describe = 'Ваш заказ отменен'
        time = '-'
        recommendation = 'Обратитесь в поддержку.'


match order:
    case 'pending'|'processing'|'shipped'|'delivered'|'cancelled':
        print('╔══════════════════════════════════════╗')
        print('║      📦 СТАТУС ВАШЕГО ЗАКАЗА 📦     ║')
        print('╚══════════════════════════════════════╝')
        print('')
        print('Статус: ', status)
        print('Описание: ', describe)
        print('Примерное время: ', time)
        print('Рекомендация: ', recommendation)
    case _:
        print('❌ Ошибка: Неизвестный статус "invalid_status"')
        print('Доступные статусы: pending, processing, shipped, delivered, cancelled')


