drink = input('Какой напиток хотите заказать? ')
portions = int(input('Сколько порций желаете? '))
sale = input('Код скидки (если нет, введите "нет"): ')

match drink:
    case 'кофе':
        order = '☕️ КВИТАНЦИЯ КАФЕ ☕️'
        name = 'Кофе☕️'
        cost_one = '120 руб'
        one_portion = 120
    case 'чай':
        order = '🍵 КВИТАНЦИЯ КАФЕ 🍵'
        name = 'Чай🍵'
        cost_one = '80 руб'
        one_portion = 80
    case 'сок':
        order = '🧃 КВИТАНЦИЯ КАФЕ 🧃'
        name = 'Сок🧃'
        cost_one = '100 руб'
        one_portion = 100
    case 'вода':
        order = '💧 КВИТАНЦИЯ КАФЕ 💧'
        name = 'Вода💧'
        cost_one = '50 руб'
        one_portion = 50
    case 'лимонад':
        order = '🥤 КВИТАНЦИЯ КАФЕ 🥤'
        name = 'Лимонад🥤'
        cost_one = '90 руб'
        one_portion = 90

match drink:
    case 'кофе'|'чай'|'сок'|'вода'|'лимонад':
        print('')
        print('╔══════════════════════════════════════╗')
        print(' ║       ', order, '       ║')
        print('╚══════════════════════════════════════╝')
        print('')
        print('Товар: ', name)
        print('Цена за порцию: ', cost_one)

        match portions:
            case 1:
                word_portion = 'порция'
            case 2 | 3 | 4:
                word_portion = 'порции'
            case _:
                word_portion = 'порций'

        print('Количество: ', portions, word_portion)
        print('Сумма: ', one_portion * portions, 'руб')
        print('')

        match sale:
            case '"STUDENT"':
                procent = '(20%)'
                minus = 0.2
            case '"ELDERLY"':
                procent = '(20%)'
                minus = 0.2
            case '"BIRTHDAY"':
                procent = '(10%)'
                minus = 0.1


        match sale:
            case '"STUDENT"'| '"ELDERLY"'| '"BIRTHDAY"':
                print(f'Скидка {sale} {procent}: -{one_portion * portions * minus:.0f} руб')
                print('═════════════════════════════════════════')
                print(f'💰 К ОПЛАТЕ:{(one_portion * portions) - (one_portion * portions * minus):.0f} руб')
            case 'нет':
                print('═════════════════════════════════════════')
                print('💰 К ОПЛАТЕ:', one_portion * portions, 'руб')
                print('═════════════════════════════════════════')
            case _:
                print('Упс! Такого кода на скидку не существует 😢')
                print('═════════════════════════════════════════')
                print('💰 К ОПЛАТЕ:', one_portion * portions, 'руб')
                print('═════════════════════════════════════════')

    case _:
        print('Упс! Такого напитка нет в меню 😢')

